# Banco de Dados - Prof. Sérgio Lifschitz

---

## Exercícios da Aula 3: Continuação com a linguagem SQL DML (consultas)


---


ANTES de começar,  ❗ **não esquecer** ❗ de, antes de mais nada, SALVAR este notebook no ambiente COLAB no drive da tua própria conta GOOGLE.

## PASSO 1: Instalação e Configuração do PostgreSQL

Basta dar PLAY que o script abaixo instalará o SGBD PostgreSQL

In [ ]:
# %%capture
# Instalação do PostgreSQL
!sudo apt-get -y -qq update
!pip install sqlalchemy==2.0
!sudo apt-get -y -qq install postgresql
!sudo service postgresql start
# Alterando a senha do usuário padrão 'postgres' para 'postgres'
!sudo -u postgres psql -U postgres -c "ALTER USER postgres PASSWORD 'postgres';"

W: Skipping acquire of configured file 'main/source/Sources' as repository 'https://r2u.stat.illinois.edu/ubuntu jammy InRelease' does not seem to provide it (sources.list entry misspelt?)
Collecting sqlalchemy==2.0
  Downloading SQLAlchemy-2.0.0-py3-none-any.whl.metadata (9.3 kB)
Requirement already satisfied: typing-extensions>=4.2.0 in /usr/local/lib/python3.12/dist-packages (from sqlalchemy==2.0) (4.15.0)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.12/dist-packages (from sqlalchemy==2.0) (3.2.4)
Downloading SQLAlchemy-2.0.0-py3-none-any.whl (1.8 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.8/1.8 MB 22.3 MB/s eta 0:00:00
Installing collected packages: sqlalchemy
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 2.0.44
    Uninstalling SQLAlchemy-2.0.44:
      Successfully uninstalled SQLAlchemy-2.0.44
Successfully installed sqlalchemy-2.0.0
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78, <> line 13.)
debconf: falling back to frontend: Readline
debconf: unable to initialize frontend: Readline
debconf: (This frontend requires a controlling tty.)
debconf: falling back to frontend: Teletype
dpkg-preconfigure: unable to re-open stdin:
Selecting previously unselected package logrotate.
(Reading database ... 126455 files and directories currently installed.)
Preparing to unpack .../00-logrotate_3.19.0-1ubuntu1.1_amd64.deb ...
Unpacking logrotate (3.19.0-1ubuntu1.1) ...
Selecting previously unselected package netbase.
Preparing to unpack .../01-netbase_6.3_all.deb ...
Unpacking netbase (6.3) ...
Selecting previously unselected package libcommon-sense-perl:amd64.
Preparing to unpack .../02-libcommon-sense-perl_3.75-2build1_amd64.deb ...
Unpacking libcommon-sense-perl:amd64 (3.75-2build1) ...
Selecting previously unselected package libjson-perl.
Preparing to unpack .../03-libjson-perl_4.04000-1_all.deb ...
Unpacking libjson-perl (4.04000-1) ...
Selecting previously unselected package libtypes-serialiser-perl.
Preparing to unpack .../04-libtypes-serialiser-perl_1.01-1_all.deb ...
Unpacking libtypes-serialiser-perl (1.01-1) ...
Selecting previously unselected package libjson-xs-perl.
Preparing to unpack .../05-libjson-xs-perl_4.040-0ubuntu0.22.04.1_amd64.deb ...
Unpacking libjson-xs-perl (4.040-0ubuntu0.22.04.1) ...
Selecting previously unselected package postgresql-client-common.
Preparing to unpack .../06-postgresql-client-common_238_all.deb ...
Unpacking postgresql-client-common (238) ...
Selecting previously unselected package postgresql-client-14.
Preparing to unpack .../07-postgresql-client-14_14.19-0ubuntu0.22.04.1_amd64.deb ...
Unpacking postgresql-client-14 (14.19-0ubuntu0.22.04.1) ...
Selecting previously unselected package ssl-cert.
Preparing to unpack .../08-ssl-cert_1.1.2_all.deb ...
Unpacking ssl-cert (1.1.2) ...
Selecting previously unselected package postgresql-common.
Preparing to unpack .../09-postgresql-common_238_all.deb ...
Adding 'diversion of /usr/bin/pg_config to /usr/bin/pg_config.libpq-dev by postgresql-common'
Unpacking postgresql-common (238) ...
Selecting previously unselected package postgresql-14.
Preparing to unpack .../10-postgresql-14_14.19-0ubuntu0.22.04.1_amd64.deb ...
Unpacking postgresql-14 (14.19-0ubuntu0.22.04.1) ...
Selecting previously unselected package postgresql.
Preparing to unpack .../11-postgresql_14+238_all.deb ...
Unpacking postgresql (14+238) ...
Selecting previously unselected package sysstat.
Preparing to unpack .../12-sysstat_12.5.2-2ubuntu0.2_amd64.deb ...
Unpacking sysstat (12.5.2-2ubuntu0.2) ...
Setting up logrotate (3.19.0-1ubuntu1.1) ...
Created symlink /etc/systemd/system/timers.target.wants/logrotate.timer → /lib/systemd/system/logrotate.timer.
Setting up libcommon-sense-perl:amd64 (3.75-2build1) ...
Setting up ssl-cert (1.1.2) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78.)
debconf: falling back to frontend: Readline
Setting up libtypes-serialiser-perl (1.01-1) ...
Setting up libjson-perl (4.04000-1) ...
Setting up netbase (6.3) ...
Setting up sysstat (12.5.2-2ubuntu0.2) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78.)
debconf: falling back to frontend: Readline

Creating config file /etc/default/sysstat with new version
update-alternatives: using /usr/bin/sar.sysstat to provide /usr/bin/sar (sar) in auto mode
Created symlink /etc/systemd/system/sysstat.service.wants/sysstat-collect.timer → /lib/systemd/system/sysstat-collect.timer.
Created symlink /etc/systemd/system/sysstat.service.wants/sysstat-summary.timer → /lib/systemd/system/sysstat-summary.timer.
Created symlink /etc/systemd/system/multi-user.target.wants/sysstat.service → /lib/systemd/system/sysstat.service.
Setting up postgresql-client-common (238) ...
Setting up libjson-xs-perl (4.040-0ubuntu0.22.04.1) ...
Setting up postgresql-client-14 (14.19-0ubuntu0.22.04.1) ...
update-alternatives: using /usr/share/postgresql/14/man/man1/psql.1.gz to provide /usr/share/man/man1/psql.1.gz (psql.1.gz) in auto mode
Setting up postgresql-common (238) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78.)
debconf: falling back to frontend: Readline
Adding user postgres to group ssl-cert

Creating config file /etc/postgresql-common/createcluster.conf with new version
Building PostgreSQL dictionaries from installed myspell/hunspell packages...
Removing obsolete dictionary files:
Created symlink /etc/systemd/system/multi-user.target.wants/postgresql.service → /lib/systemd/system/postgresql.service.
Setting up postgresql-14 (14.19-0ubuntu0.22.04.1) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78.)
debconf: falling back to frontend: Readline
Creating new PostgreSQL cluster 14/main ...
/usr/lib/postgresql/14/bin/initdb -D /var/lib/postgresql/14/main --auth-local peer --auth-host scram-sha-256 --no-instructions
The files belonging to this database system will be owned by user "postgres".
This user must also own the server process.

The database cluster will be initialized with locale "en_US.UTF-8".
The default database encoding has accordingly been set to "UTF8".
The default text search configuration will be set to "english".

Data page checksums are disabled.

fixing permissions on existing directory /var/lib/postgresql/14/main ... ok
creating subdirectories ... ok
selecting dynamic shared memory implementation ... posix
selecting default max_connections ... 100
selecting default shared_buffers ... 128MB
selecting default time zone ... Etc/UTC
creating configuration files ... ok
running bootstrap script ... ok
performing post-bootstrap initialization ... ok
syncing data to disk ... ok
update-alternatives: using /usr/share/postgresql/14/man/man1/postmaster.1.gz to provide /usr/share/man/man1/postmaster.1.gz (postmaster.1.gz) in auto mode
invoke-rc.d: could not determine current runlevel
invoke-rc.d: policy-rc.d denied execution of start.
Setting up postgresql (14+238) ...
Processing triggers for man-db (2.10.2-1) ...
 * Starting PostgreSQL 14 database server
   ...done.
ALTER ROLE

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

## PASSO 2: Preparo do Esquema Relacional EMPRESA

Baixe o esquema e instância de teste do BD EMPRESA neste link: https://drive.google.com/file/d/1zFlLaVJIWZokadeKWICYrWhTW_I2o_Bj/view?usp=sharing

❗Coloque o arquivo baixado *.SQL na **pasta padrão do seu Google Drive** ❗

Em seguida, é só dar PLAY (nas duas células seguintes!) pois os scripts (programas) abaixo preparam o ambiente para realizar consultas SQL no esquema de BD EMPRESA no seu próprio COLAB.

In [ ]:
# [2.1] Monta o diretório do Google Drive no seu Colab
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
# [2.2] Cria o esquema no banco de dados EMPRESA no Colab
%%capture
!sudo -u postgres psql -U postgres -c 'DROP SCHEMA IF EXISTS empresa CASCADE;'
!sudo -u postgres psql -U postgres -c 'CREATE SCHEMA empresa;'
!PGPASSWORD='postgres' psql -h localhost -U postgres -d postgres -a -f drive/MyDrive/esquema_empresa.sql

## PASSO 3: Preparando para usar o SGBD PostgreSQL localmente

Mais uma vez, é só dar PLAY (nas duas células seguintes!)

In [ ]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

# Configurando o PostgreSQL na variável de ambiente DATABASE_URL
%env DATABASE_URL=postgresql://postgres:postgres@localhost:5432/postgres

env: DATABASE_URL=postgresql://postgres:postgres@localhost:5432/postgres

In [ ]:
# Carregando a extensão sql para usar o SQL pelo Google Colab
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

## **Lista de Exercícios**

Prática de SQL sobre o esquema EMPRESA implantado no SGBD PostgreSQL, já considerando a sintaxe completa após as 3 aulas do módulo "Banco de Dados"

### Esquema relacional da **base de dados Empresa**:

Seja o esquema relacional da base de dados simplificada de uma EMPRESA genérica. As chaves primárias (PK) respectivas estão sublinhadas e as chaves estrangeiras em itálico

<img src='https://drive.google.com/uc?id=1JWCG8paO9ksU-22L79Qmnkb4iYAHnlOy'>

A empresa é organizada em departamentos, cada qual tendo um nome, um número de identificação e um empregado (gerente) responsável pelo mesmo. Guarda-se como informação a data a partir da qual o empregado assumiu a gerência do departamento. Um departamento pode estar presente em diversas localidades do país.

Um departamento controla um certo número de projetos, e cada projeto tem um nome, um número de identificação e uma localidade única. Os departamentos têm vários empregados, para os quais guarda-se os respectivos nomes, número de identificação (Ident) na empresa, endereço (End) residencial, sexo, data de nascimento e salário (sal) em reais. Todo empregado tem um empregado que é seu superior hierárquico (supervisor direto - SuperIdent) dentro do departamento, informação que também deve ser mantida no banco de dados.

Um empregado é alocado a um único departamento mas pode trabalhar em mais de um projeto, estes não necessariamente controlados pelo departamento ao qual ele pertence. Controla-se o total de horas semanais (HRS) em que um empregado trabalha em cada projeto.

Para fim de controle de seguro de saúde de cada empregado, deve-se manter informações dos nomes, sexo, data de nascimento e grau de parentesco de seus dependentes. Estes são identificados por seu nome mas, também, pela identidade do empregado do qual dependem.

As restrições de integridade referenciais são: o atributo SuperIdent é chave estrangeira (FK) referenciando a PK da própria tabela EMPREGADO, da mesma forma que IdentGer em DEPARTAMENTO e IdentEmp em TRABALHA_NO e DEPENDENTE. DepNum é FK para a PK Num em DEPARTAMENTO em 3 tabelas: Empregado, Projeto e DepLoc. Por fim, ProjNum é FK em TRABALHA_NO referenciando a PK Num em PROJETO.

**ATENÇÃO:** deve-se dar play na próxima célula sempre que for usar o esquema EMPRESA!

In [ ]:
# Ativando o esquema empresa
%%sql
SET SCHEMA 'empresa';

Done.

[]

**Consulta exemplo:** Quais empregados trabalham no Departamento de Informática?

In [ ]:
# Para rodar a consulta em SQL abaixo, basta dar PLAY nesta célula!

# Se quiser, pode mudar o departamento e verificar as respostas
# (instâncias!) distintas. Para isso consultar quais departamentos
# existem na tabela Departamento desta instância exemplo.

# Atenção ao uso de acentos, maiúsculas e minúsculas: para SQL e para atributos
# das relações não faz diferença. Entretando, para valores sim! Se tivesse usado
# "informática" com acento ou tudo minúsculo teria retornado uma tabela vazia.

%%sql

SELECT ident as IDENTIDADE, nome as NOME_EMPREGADO
FROM   empregado
WHERE  depnum in (SELECT num
                  FROM departamento
                  WHERE nome = 'Informatica')

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[(Decimal('8'), 'José Carlos         '),
 (Decimal('11'), 'Silvano Silva       '),
 (Decimal('14'), 'Bruno Peixoto       '),
 (Decimal('20'), 'Raphael Mendes      '),
 (Decimal('26'), 'Luana Marques       ')]

### 1. Listar todos os Números dos projetos e os respectivos Números de departamentos que os controlam.

In [ ]:
%%sql

select Num, DepNum
from Projeto AS P;

 * postgresql://postgres:***@localhost:5432/postgres
11 rows affected.

[(Decimal('10'), Decimal('4')),
 (Decimal('30'), Decimal('4')),
 (Decimal('20'), Decimal('1')),
 (Decimal('0'), Decimal('2')),
 (Decimal('40'), Decimal('13')),
 (Decimal('50'), Decimal('13')),
 (Decimal('60'), Decimal('15')),
 (Decimal('70'), Decimal('11')),
 (Decimal('80'), Decimal('15')),
 (Decimal('90'), Decimal('3')),
 (Decimal('100'), Decimal('8'))]

### 2 Listar todos os Números e Nomes dos projetos, e os respectivos Números e Nomes de departamentos que os controlam.

In [ ]:
%%sql

select P.Num, P.Nome, D.Num, D.Nome
from Projeto AS P, Departamento AS D
where P.DepNum = D.Num;

 * postgresql://postgres:***@localhost:5432/postgres
11 rows affected.

[(Decimal('10'), 'Informatizacao ', Decimal('4'), 'Economia                 '),
 (Decimal('30'), 'Reengenharia   ', Decimal('4'), 'Economia                 '),
 (Decimal('20'), 'Pagamentos     ', Decimal('1'), 'Financeiro               '),
 (Decimal('0'), 'Excursão       ', Decimal('2'), 'Historia                 '),
 (Decimal('40'), 'Genoma         ', Decimal('13'), 'BioInformatica           '),
 (Decimal('50'), 'Big Data       ', Decimal('13'), 'BioInformatica           '),
 (Decimal('60'), 'Reagindo       ', Decimal('15'), 'Nanotecnologia           '),
 (Decimal('70'), 'Câmeras        ', Decimal('11'), 'Segurança                '),
 (Decimal('80'), 'NanoParticulas ', Decimal('15'), 'Nanotecnologia           '),
 (Decimal('90'), 'CorreçãoBugs   ', Decimal('3'), 'Informatica              '),
 (Decimal('100'), 'Vacinação      ', Decimal('8'), 'Farmacia                 ')]

### 3. Exibir o nome e grau de parentesco dos dependentes juntamente com a identidade e nome dos empregados dos quais dependem.

In [ ]:
%%sql
select d.Nome as "Nome Dependente", d.Parentesco as "Grau de parentesco", e.Ident as "Identidade Empregado", e.Nome as "Nome Empregado"
from Dependente as d, Empregado as e
where d.IdentEmp = e.ident;

 * postgresql://postgres:***@localhost:5432/postgres
24 rows affected.

[('Maria               ', 'FILHA     ', Decimal('1'), 'Joao                '),
 ('João                ', 'IRMÃO     ', Decimal('1'), 'Joao                '),
 ('José                ', 'PAI       ', Decimal('1'), 'Joao                '),
 ('Carlos              ', 'PAI       ', Decimal('2'), 'Maria               '),
 ('Claudio             ', 'IRMÃO     ', Decimal('2'), 'Maria               '),
 ('Lurdes              ', 'FILHA     ', Decimal('4'), 'Ciclano             '),
 ('Lurdinalva          ', 'IRMÃ      ', Decimal('4'), 'Ciclano             '),
 ('Luan Santana        ', 'PAI       ', Decimal('4'), 'Ciclano             '),
 ('Elba Ramalho        ', 'MÃE       ', Decimal('6'), 'Luciano Mauri       '),
 ('Preta Gil           ', 'IRMÃ      ', Decimal('6'), 'Luciano Mauri       '),
 ('Fafa de Belem       ', 'MÃE       ', Decimal('8'), 'José Carlos         '),
 ('Gustavo Lima        ', 'FILHO     ', Decimal('9'), 'Maria José          '),
 ('Thaeme              ', 'IRMÃ      ', Decimal('13'), 'Jorge Sousa         '),
 ('Thiago              ', 'FILHO     ', Decimal('13'), 'Jorge Sousa         '),
 ('Maria Cecilia       ', 'PRIMA     ', Decimal('15'), 'Bruna Carla         '),
 ('Rodolfo             ', 'PAI       ', Decimal('15'), 'Bruna Carla         '),
 ('Antônio             ', 'PAI       ', Decimal('16'), 'Bianca Lourenco     '),
 ('Lucas               ', 'FILHO     ', Decimal('17'), 'Felicidade Maria    '),
 ('Tadeu               ', 'AVÔ       ', Decimal('17'), 'Felicidade Maria    '),
 ('Agueda              ', 'PRIMA     ', Decimal('17'), 'Felicidade Maria    '),
 ('Luzia               ', 'FILHA     ', Decimal('20'), 'Raphael Mendes      '),
 ('Ines                ', 'FILHA     ', Decimal('21'), 'Raphaela Fontoura   '),
 ('Anastacia           ', 'MÃE       ', Decimal('23'), 'Paola Silva         '),
 ('Rita                ', 'AVÓ       ', Decimal('23'), 'Paola Silva         ')]

### 4. Para cada empregado, mostrar seu nome e sexo, e a identidade e nome do seu superior imediato.

In [ ]:
%%sql
select e.Nome, e.Sexo, s.Ident, s.Nome
from Empregado as e, Empregado as s
where e.SuperIdent = s.Ident;

 * postgresql://postgres:***@localhost:5432/postgres
18 rows affected.

[('Felicidade Maria    ', 'F', Decimal('22'), 'Laura Benayon       '),
 ('Ciclano             ', 'M', Decimal('2'), 'Maria               '),
 ('Silvano Silva       ', 'M', Decimal('17'), 'Felicidade Maria    '),
 ('Jorge Sousa         ', 'M', Decimal('6'), 'Luciano Mauri       '),
 ('Bruno Peixoto       ', 'M', Decimal('8'), 'José Carlos         '),
 ('Bianca Lourenco     ', 'F', Decimal('16'), 'Bianca Lourenco     '),
 ('Luciana Fernandes   ', 'F', Decimal('21'), 'Raphaela Fontoura   '),
 ('Marcos Guedes       ', 'M', Decimal('7'), 'João Maria          '),
 ('Luana Marques       ', 'F', Decimal('10'), 'Johnny Depp         '),
 ('Maria José          ', 'F', Decimal('11'), 'Silvano Silva       '),
 ('Paola Silva         ', 'F', Decimal('27'), 'Simone Estoggliato  '),
 ('Bruna Carla         ', 'F', Decimal('10'), 'Johnny Depp         '),
 ('Ariane Goncalves    ', 'F', Decimal('18'), 'Luciana Fernandes   '),
 ('Luciano Mauri       ', 'M', Decimal('15'), 'Bruna Carla         '),
 ('Leandro Silva       ', 'M', Decimal('7'), 'João Maria          '),
 ('João Maria          ', 'M', Decimal('10'), 'Johnny Depp         '),
 ('Laura Benayon       ', 'F', Decimal('25'), 'Natasha Gasparelli  '),
 ('Johnny Depp         ', 'M', Decimal('2'), 'Maria               ')]

### 5. Listar os diferentes valores de salários pagos aos empregados da empresa.

In [ ]:
%%sql
select distinct sal
from Empregado;

 * postgresql://postgres:***@localhost:5432/postgres
15 rows affected.

[(Decimal('12335.00'),),
 (Decimal('2000.00'),),
 (Decimal('30001.00'),),
 (Decimal('2.00'),),
 (Decimal('23265.00'),),
 (Decimal('5878.00'),),
 (Decimal('6554.00'),),
 (Decimal('1245.00'),),
 (Decimal('5222.00'),),
 (Decimal('10000.00'),),
 (Decimal('1000.00'),),
 (Decimal('22233.00'),),
 (Decimal('11255.00'),),
 (Decimal('5598.00'),),
 (Decimal('7500.00'),)]

### 6. Quais os nomes dos empregados que trabalham menos de 20 horas por semana em algum projeto?

In [ ]:
%%sql

select distinct e.Nome
from Empregado as e, TrabalhaNo as t
where e.Ident = t.IdentEmp and t.Hrs < 20;

 * postgresql://postgres:***@localhost:5432/postgres
27 rows affected.

[('Luciano Mauri       ',),
 ('Paola Silva         ',),
 ('Raphaela Fontoura   ',),
 ('Joao                ',),
 ('Luciana Fernandes   ',),
 ('Maria               ',),
 ('Ariane Goncalves    ',),
 ('Bruna Carla         ',),
 ('Severino Buarque    ',),
 ('Ciclano             ',),
 ('Luana Marques       ',),
 ('Laura Benayon       ',),
 ('Caetano Veloso      ',),
 ('Raphael Mendes      ',),
 ('Johnny Depp         ',),
 ('Felicidade Maria    ',),
 ('Jorge Sousa         ',),
 ('Marcos Guedes       ',),
 ('Natasha Gasparelli  ',),
 ('José Carlos         ',),
 ('Leandro Silva       ',),
 ('Bianca Lourenco     ',),
 ('João Maria          ',),
 ('Bruno Peixoto       ',),
 ('Simone Estoggliato  ',),
 ('Silvano Silva       ',),
 ('Maria José          ',)]

### 7. Apresentar os nomes de todos os empregados que não têm dependentes.

In [ ]:
%%sql

select e.Nome
from Empregado as e
where e.Ident not in (select d.IdentEmp from Dependente as d);

 * postgresql://postgres:***@localhost:5432/postgres
14 rows affected.

[('Silvano Silva       ',),
 ('Bruno Peixoto       ',),
 ('Luciana Fernandes   ',),
 ('Marcos Guedes       ',),
 ('Natasha Gasparelli  ',),
 ('Luana Marques       ',),
 ('Simone Estoggliato  ',),
 ('Ariane Goncalves    ',),
 ('Leandro Silva       ',),
 ('João Maria          ',),
 ('Severino Buarque    ',),
 ('Laura Benayon       ',),
 ('Caetano Veloso      ',),
 ('Johnny Depp         ',)]

### 8. Quais empregados tem cargos de chefia, isto é, não têm superior imediato?

In [ ]:
%%sql

select e.nome
from empregado e
where e.superident is null;

 * postgresql://postgres:***@localhost:5432/postgres
9 rows affected.

[('Maria               ',),
 ('José Carlos         ',),
 ('Raphael Mendes      ',),
 ('Natasha Gasparelli  ',),
 ('Simone Estoggliato  ',),
 ('Raphaela Fontoura   ',),
 ('Severino Buarque    ',),
 ('Caetano Veloso      ',),
 ('Joao                ',)]

### 9. Listar todos os locais onde se encontram departamentos da empresa ou onde são realizados projetos.

In [ ]:
%%sql

(select distinct local
from deploc)
union
(select distinct local
from projeto);

 * postgresql://postgres:***@localhost:5432/postgres
10 rows affected.

[('Belo Horizonte ',),
 ('Queimadas      ',),
 ('Natal          ',),
 ('Salvador       ',),
 ('Porto Alegre   ',),
 ('Florianopolis  ',),
 ('Vitoria        ',),
 ('Cabo Frio      ',),
 ('Rio de Janeiro ',),
 ('São Paulo      ',)]

### 10. Apresentar o resultado dos salários dos empregados que trabalham no projeto “Reengenharia” caso fosse dado um aumento de 10%.

In [ ]:
%%sql
select e.nome, 1.10 * e.sal as "Sal * 1,10"
from empregado as e, trabalhano as t, projeto as p
WHERE p.nome = 'Reengenharia'
AND e.ident = t.identEmp
and t.projNum = p.num;

 * postgresql://postgres:***@localhost:5432/postgres
6 rows affected.

[('Ciclano             ', Decimal('1100.0000')),
 ('Raphael Mendes      ', Decimal('24456.3000')),
 ('Bruna Carla         ', Decimal('6465.8000')),
 ('João Maria          ', Decimal('11000.0000')),
 ('Caetano Veloso      ', Decimal('2200.0000')),
 ('Johnny Depp         ', Decimal('33001.1000'))]


### 11. Quais os nomes dos empregados e os números de departamento dos quais eles são gerentes, se o forem?

In [ ]:
%%sql

select distinct e.nome, d.num
from empregado as e, departamento as d
where e.ident = d.identGer
order by e.nome;

 * postgresql://postgres:***@localhost:5432/postgres
17 rows affected.

[('Ariane Goncalves    ', Decimal('10')),
 ('Bruna Carla         ', Decimal('9')),
 ('Caetano Veloso      ', Decimal('5')),
 ('Joao                ', Decimal('11')),
 ('Joao                ', Decimal('15')),
 ('João Maria          ', Decimal('6')),
 ('Johnny Depp         ', Decimal('8')),
 ('Jorge Sousa         ', Decimal('2')),
 ('Leandro Silva       ', Decimal('13')),
 ('Luciano Mauri       ', Decimal('12')),
 ('Maria               ', Decimal('3')),
 ('Maria               ', Decimal('4')),
 ('Maria               ', Decimal('28319')),
 ('Maria José          ', Decimal('7')),
 ('Paola Silva         ', Decimal('1')),
 ('Raphaela Fontoura   ', Decimal('14')),
 ('Severino Buarque    ', Decimal('9000'))]

### 12. Listar os nomes dos empregados, assim como os departamentos onde trabalham, que ganham mais do que qualquer empregado do departamento de nome *Pesquisa*

In [ ]:
%%sql

select e.nome, d.nome, e.sal
from empregado as e, departamento as d
where e.depnum = d.num
and e.sal > any (select sal from empregado e inner join departamento d on e.depnum = d.num  and d.nome = 'Pesquisa');

 * postgresql://postgres:***@localhost:5432/postgres
23 rows affected.

[('Felicidade Maria    ', 'Pesquisa                 ', Decimal('11255.00')),
 ('José Carlos         ', 'Informatica              ', Decimal('11255.00')),
 ('Silvano Silva       ', 'Informatica              ', Decimal('22233.00')),
 ('Jorge Sousa         ', 'Historia                 ', Decimal('5598.00')),
 ('Bruno Peixoto       ', 'Informatica              ', Decimal('6554.00')),
 ('Bianca Lourenco     ', 'Historia                 ', Decimal('12335.00')),
 ('Luciana Fernandes   ', 'Economia                 ', Decimal('1245.00')),
 ('Raphael Mendes      ', 'Informatica              ', Decimal('22233.00')),
 ('Marcos Guedes       ', 'Economia                 ', Decimal('23265.00')),
 ('Natasha Gasparelli  ', 'Historia                 ', Decimal('22233.00')),
 ('Luana Marques       ', 'Informatica              ', Decimal('5222.00')),
 ('Maria José          ', 'Pessoal                  ', Decimal('1245.00')),
 ('Paola Silva         ', 'Financeiro               ', Decimal('1245.00')),
 ('Bruna Carla         ', 'Entregas                 ', Decimal('5878.00')),
 ('Ariane Goncalves    ', 'Matematica               ', Decimal('23265.00')),
 ('Luciano Mauri       ', 'Nanotecnologia           ', Decimal('23265.00')),
 ('Leandro Silva       ', 'BioInformatica           ', Decimal('5222.00')),
 ('Raphaela Fontoura   ', 'Quimica                  ', Decimal('5222.00')),
 ('João Maria          ', 'RH                       ', Decimal('10000.00')),
 ('Severino Buarque    ', 'Biologia                 ', Decimal('7500.00')),
 ('Laura Benayon       ', 'Historia                 ', Decimal('11255.00')),
 ('Caetano Veloso      ', 'Biologia                 ', Decimal('2000.00')),
 ('Johnny Depp         ', 'Farmacia                 ', Decimal('30001.00'))]

### 13. Listar os nomes dos empregados que trabalham o mesmo total de horas em algum projeto em que o empregado Caetano Veloso trabalha

In [ ]:
%%sql

select e.nome, t.hrs,
from empregado as e, trabalhaNo as t
where e.ident = t.identEmp
and t.hrs = (select sum(hrs) from trabalhaNo where identEmp = (select ident from empregado where nome = 'Caetano Veloso'))
and e.nome <> 'Caetano Veloso';

 * postgresql://postgres:***@localhost:5432/postgres
4 rows affected.

[('Maria               ', Decimal('8')),
 ('Raphaela Fontoura   ', Decimal('8')),
 ('Laura Benayon       ', Decimal('8')),
 ('Luana Marques       ', Decimal('8'))]

### 14. Quais empregados ganham o maior salário? Listar identidade, nome e salário.

In [ ]:
%%sql

select ident, nome, sal
from empregado
where sal = (select max(sal) from empregado);

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[(Decimal('10'), 'Johnny Depp         ', Decimal('30001.00'))]

### 15. Quais os nomes dos empregados que ganham os 3 maiores salários da empresa?

In [ ]:
%%sql

select nome, sal
from empregado
order by sal desc
limit 3;

 * postgresql://postgres:***@localhost:5432/postgres
3 rows affected.

[('Johnny Depp         ', Decimal('30001.00')),
 ('Ariane Goncalves    ', Decimal('23265.00')),
 ('Marcos Guedes       ', Decimal('23265.00'))]

# OUTRAS e NOVAS CONSULTAS podem ser propostas para prática de SQL nesta Sprint.

⚡ **Fiquem atentos ao Discord!**  ⚡

# Seguem, abaixo, as células com as consultas resolvidas!


---


❗**NÃO OLHAR ANTES de TENTAR FAZER** ❗

In [ ]:
#1 Listar todos os Números dos projetos e os respectivos Números de departamentos que os controlam.
%%sql
SELECT Num AS NumProjeto, DepNum as NumDeptoControlador
FROM Projeto

In [ ]:
#2 Listar todos os Números e Nomes dos projetos, e os respectivos Números e Nomes de departamentos que os controlam.
%%sql
SELECT P.Num AS NumProjeto, P.Nome as NomeProjeto, D.Num as NumDepto, D.Nome as NomeDepto
FROM Projeto P INNER JOIN Departamento D
ON P.Depnum = D.Num

In [ ]:
#3 Exibir o nome e grau de parentesco dos dependentes juntamente com a identidade e nome dos empregados dos quais dependem.
%%sql
SELECT Depe.Nome, Parentesco, Ident, Emp.Nome
FROM DEPENDENTE as Depe INNER JOIN EMPREGADO as Emp
ON IdentEmp = Ident;

In [ ]:
#4 Para cada empregado, mostrar seu nome e sexo, e a identidade e nome do seu superior imediato.
%%sql
SELECT E.Nome as NomeEmpregado, E.Sexo as SexoEmpregado, S.Ident as IdentSuperior, S.Nome as SexoSuperior
FROM EMPREGADO as E INNER JOIN EMPREGADO as S
ON E.SUPERIDENT= S.IDENT;

In [ ]:
#4 Solução alternativa com JOIN a la SQL2
%%sql
SELECT E.Ident as IdentSuper, E.NOME as NomeSuper, S.NOME as NomeSub, S.SEXO as SexoSub
FROM EMPREGADO as E, EMPREGADO as S
WHERE E.SUPERIDENT= S.IDENT;

In [ ]:
#5 Listar os diferentes valores de salários pagos aos empregados da empresa.
%%sql
SELECT DISTINCT Sal
FROM EMPREGADO;

In [ ]:
#6 Quais os nomes dos empregados que trabalham menos de 20 horas por semana em algum projeto?
%%sql
SELECT DISTINCT Nome
FROM EMPREGADO INNER JOIN TRABALHANO
ON Ident = IdentEmp
WHERE HRS < 20;

In [ ]:
#7 Apresentar os nomes de todos os empregados que não têm dependentes.
%%sql
SELECT nome
FROM empregado
WHERE ident NOT IN
  (SELECT identEmp
   FROM   Dependente)

In [ ]:
#8 Quais empregados tem cargos de chefia, isto é, não têm superior imediato?
%%sql
SELECT nome
FROM empregado
WHERE superident is NULL

In [ ]:
#9 Listar todos os locais onde se encontram departamentos da empresa ou onde são realizados projetos.
%%sql
( SELECT	Local 	FROM		PROJETO )
UNION  -- ou UNION ALL
( SELECT	Local 	FROM		DEPLOC )

In [ ]:
#10 Apresentar o resultado dos salários dos empregados que trabalham no projeto “Reengenharia” caso fosse dado um aumento de 10%.
%%sql
SELECT	EMPREGADO.NOME, 1.1*SAL AS SALARIOmais10porcento
FROM 		EMPREGADO, TRABALHANO, PROJETO
WHERE 	EMPREGADO.IDENT = TRABALHANO.IDENTEMP
AND 		TRABALHANO.PROJNUM = PROJETO.NUM
AND 		PROJETO.NOME = 'Reengenharia';

In [ ]:
#11 Quais os nomes dos empregados e os números de departamento dos quais eles são gerentes, se o forem?
%%sql
SELECT Distinct E.nome, D.num as "Numero se for gerente"
FROM 		        Departamento D RIGHT OUTER JOIN Empregado E
ON 		          E.Ident = D.IdentGer
ORDER BY 	      E.nome

In [ ]:
#12 	Listar os nomes dos empregados, assim como os departamentos onde trabalham, que ganham mais do que qualquer empregado do departamento de nome “Pesquisa”
%%sql
SELECT 	E.nome AS NomeEmp, D.nome AS NomeDepto
FROM		empregado E INNER JOIN departamento D
ON 	    E.depnum = D.num
AND 		sal >ALL
            (
              SELECT sal
						  FROM    empregado E INNER JOIN departamento D
						  ON      E.depnum = D.num
              AND 		D.nome = 'Pesquisa'
            )

In [ ]:
#13 Listar os nomes dos empregados que trabalham o mesmo total de horas em algum projeto em que o empregado Caetano Veloso trabalha
%%sql
SELECT 	DISTINCT Nome
FROM 		Trabalhano T1, Empregado E1
WHERE 	T1.IdentEmp = E1.Ident
AND		  E1.Nome <> 'Caetano Veloso'
AND 		EXISTS
    (
      SELECT ProjNum, HRS
		 	FROM Trabalhano T2, Empregado E2
		 	WHERE T2.IdentEmp = E2.Ident
		 	AND E2.Nome = 'Caetano Veloso'
		 	AND T2.ProjNum = T1.ProjNum
		 	AND T2.HRS = T1.HRS
    )

In [ ]:
#14 Quais empregados ganham o maior salário? Listar identidade, nome e salário.
%%sql
SELECT ident, nome, sal
FROM   empregado
WHERE  sal IN
  (
    SELECT max(sal)
    FROM   empregado
  )

In [ ]:
#15 Quais os nomes dos empregados que ganham os 3 maiores salários da empresa?
# solução 1: força bruta ...
%%sql
SELECT ident, nome, sal
FROM empregado
WHERE sal IN
    (SELECT MAX(sal)
     FROM empregado)
OR sal IN
    (SELECT MAX(sal)
     FROM empregado
     WHERE sal NOT IN
        (SELECT MAX(sal)
         FROM empregado))
OR sal IN
    (SELECT MAX(sal)
     FROM empregado
     WHERE sal NOT IN
        (SELECT MAX(sal)
         FROM empregado)
    AND sal NOT IN
        (SELECT MAX(sal)
         FROM empregado
         WHERE sal NOT IN
             (SELECT MAX(sal)
              FROM empregado)))
ORDER BY sal desc

In [ ]:
#15 Solução alternativa e mais elegante: se quiser os 5 maiores,
## basta substituir 3 por 5
%%sql
SELECT ident, nome, sal
FROM   empregado e1
WHERE  3 >
  (
    SELECT count (distinct SAL)
		FROM   empregado e2
		WHERE  e2.sal > e1.sal
  )
ORDER BY sal desc